funcs.org
#+TITLE: funcs.el
#+PROPERTY: header-args :tangle yes

Custom functions to help do things in org.

* Unique IDs
:PROPERTIES:
:ID:       1cdf1b4f-be05-472c-bba8-151462f02bb6
:END:

When entries have unique IDs it enables better cross referencing between entries
and links work even when entries are moved to different files.

This function will add ids to each headline in the file that does not already have one.

https://stackoverflow.com/a/16247032
#+BEGIN_SRC elisp
  (defun my/org-add-ids-to-headlines-in-file ()
    "Add ID properties to all headlines in the current file which
  do not already have one."
    (interactive)
    (org-map-entries 'org-id-get-create))
#+END_SRC

This function will remove an id from an entry and remove it from the global list
https://emacs.stackexchange.com/a/30398
#+BEGIN_SRC elisp
  (defun my/org-id-remove-entry ()
    "Remove/delete the ID entry and update the databases.
  Update the `org-id-locations' global hash-table, and update the
  `org-id-locations-file'.  `org-id-track-globally' must be `t`."
    (interactive)
    (save-excursion
      (org-back-to-heading t)
      (when (org-entry-delete (point) "ID")
        (org-id-update-id-locations nil 'silent))))
#+END_SRC

Some other ideas that might be useful:

https://writequit.org/articles/emacs-org-mode-generate-ids.html#automating-id-creation

* Find org files recursively

#+BEGIN_SRC elisp
;; recursively find .org files in provided directory
;; modified from an Emacs Lisp Intro example
(defun sa-find-org-file-recursively (&optional directory filext)
  "Return .org and .org_archive files recursively from DIRECTORY.
If FILEXT is provided, return files with extension FILEXT instead."
  (interactive "DDirectory: ")
  (let* (org-file-list
	 (case-fold-search t)	      ; filesystems are case sensitive
	 (file-name-regex "^[^.#].*") ; exclude dot, autosave, and backup files
	 (filext (or filext "org$\\\|org_archive"))
	 (fileregex (format "%s\\.\\(%s$\\)" file-name-regex filext))
	 (cur-dir-list (directory-files directory t file-name-regex)))
    ;; loop over directory listing
    (dolist (file-or-dir cur-dir-list org-file-list) ; returns org-file-list
      (cond
       ((file-regular-p file-or-dir) ; regular files
	(if (string-match fileregex file-or-dir) ; org files
	    (add-to-list 'org-file-list file-or-dir)))
       ((file-directory-p file-or-dir)
	(dolist (org-file (sa-find-org-file-recursively file-or-dir filext)
			  org-file-list) ; add files found to result
	  (add-to-list 'org-file-list org-file)))))))
#+END_SRC
